
// Задача 2. Программа принимает на вход два числа и выдает, какое число большее, а какое меньшее.

int num1, num2;

Console.Write("Input the first integer number ");
num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second integer number ");
num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2)
    Console.Write(num1 + " > " + num2 + " ");
else
    Console.Write(num2 + " > " + num1 + " ");

// Задача 4: Программа принимает на вход три числа и выдаёт максимальное из этих чисел.

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

