
/*
// Задача 2. Программа принимает на вход два числа и выдает, какое число большее, а какое меньшее.

int num1, num2;

Console.Write("Input the first integer number ");
num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second integer number ");
num2 = Convert.ToInt32(Console.ReadLine());

if(num1 == num2)
{
    Console.WriteLine("Error. Please, input two different integer numbers. Input the first integer number ");
    num1 = Convert.ToInt32(Console.ReadLine());
    Console.Write("Input the second integer number ");
    num2 = Convert.ToInt32(Console.ReadLine());
}

if(num1 > num2)
    Console.Write(num1 + " > " + num2 + " ");
else
    Console.Write(num2 + " > " + num1 + " ");
*/

// Задача 4: Программа принимает на вход три числа и выдаёт максимальное из этих чисел.
/*
int num1, num2, num3, max;

Console.Write("Input the first integer number ");
num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second integer number ");
num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the third integer number ");
num3 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
    max = num1;
else
    max = num2;
if(max < num3)
    max = num3;

Console.WriteLine(max);
*/

// Задача 6: Программа на вход принимает число и выдаёт, является ли число чётным (делится ли оно на 
// два без остатка).



// Задача 8: Программа, которая на вход принимает число (N), а на выходе показывает все чётные числа 
// от 1 до N.

